app/controllers/articles_controller.rb

  def create
    @article = Article.new
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-07-01 14:00:56.601478"], ["updated_at", "2019-07-01 14:00:56.601478"]]